Tekla Open API Reference for Tekla Structures 2025
IntList.RemoveRange Method
 Removes a range of items starting from the given index.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveRange(
	int index,
	int count
)
Public Sub RemoveRange (
	index As Integer,
	count As Integer
)
Parameters
index
Type: System.Int32
The start index.
count
Type: System.Int32
The number of items to be removed.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace